# SheetAssemblyManufacturer Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SheetAssemblyManufacturer Property
ParameterTypeId Class See Also
---
"Assembly: Manufacturer"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SheetAssemblyManufacturer { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetAssemblyManufacturer As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetAssemblyManufacturer {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace